using UnityEngine;
using UnityEngine.UI;

public class descriptionasglavs : MonoBehaviour
{
    public Animator wa;
    public Text t;

    public void click1()
    {
        wa.Play("opendes");
        t.text = "Мы покидаем орбиту Земли и держим курс на Луну. Сначала всё спокойно: впереди — серебристый горизонт, обещающий тихую посадку. Но на полпути путь преграждает астероидное поле, и мы пробиваемся сквозь хаос. Добравшись до Луны, видим мёртвую тишину кратеров. Внезапно начинается буря, и мы вынуждены резко уйти вверх, чтобы избежать удара. Именно в этот момент приборы фиксируют резкие искажения. Вдруг возникает загадочный силуэт — будто чёрная дыра. Теперь ясно: за видимой бурей скрывается нечто большее, и главная аномалия только впереди.";
    }
    public void click2()
    {
        wa.Play("opendes");
        t.text = "Мы влетаем в чёрную дыру, и всё вокруг искажается. Галлюцинации охватывают сознание: бесконечный коридор из игрушек, словно мир превратился в детскую иллюзию. Впереди — яркий белый свет. Прорыв — и теперь мы в комнате, стены которой состоят из бесчисленных часов. Следующий миг — падение в узор, будто сама ткань пространства ломается, заворачиваясь в невозможные формы. Камера гаснет, связь теряется, и вдруг возвращается. Мы оказываемся в розово-синем космосе, сияющем как живое северное сияние. И внезапно — удар. Метеор врезается в корпус, двигатель разрушается.";
    }
    public void click3()
    {
        wa.Play("opendes");
        t.text = "Скоро.";
    }   
    public void close()
    {
        wa.Play("closedes");
    }
}
